import 'domain/sight.dart';
// Тестовые данные
final List<Sight> mocks = [
  Sight(
      'Ивановская площадь',
      '55.751426',
      '37.618879',
      'https://liveinmsk.ru/up/photos/album/kremlin/1327.jpg',
      'Ивановская площадь — площадь в Московском Кремле, одна из древнейших площадей Москвы. Возникла после постройки в 1329 году каменной церкви Иоанна Лествичника, «что под колоколы», которая разделила ранее единую городскую площадь на две части. Её восточная часть по Иоанновской церкви стала позднее именоваться Ивановской, западная — Соборной площадью. В XIV—XV веках южную и восточную стороны площади занимали дворы удельных князей Московского дома.',
      'площадь'),
  Sight(
      'Собор Покрова Пресвятой Богородицы на Рву',
      '55.752507',
      '37.623150',
      'https://core-pht-proxy.maps.yandex.ru/v1/photos/download?photo_id=AeTsFjACB100OdQCCe_5Wg&image_size=L',
      'Православный храм на Красной площади в Москве, памятник русской архитектуры. Строительство собора велось с 1555 по 1561 год. Собор объединяет одиннадцать церквей, часть из которых освящена в честь святых, дни памяти которых пришлись на решающие бои за Казань.',
      'храм'),
  Sight(
      'Государственная Третьяковская галерея',
      '55.741392',
      '37.620522',
      'https://avatars.mds.yandex.net/get-altay/223006/2a0000015b171765cf7ab0eaae8e1489f6f1/XXXL',
      'Историческое здание Третьяковской галереи по адресу Лаврушинский переулок, 10 расположено в комплексе строений, основой которого является особняк второй половины XVIII века. Семья Третьяковых приобрела этот дом в 1851 году. Начав в 1856 собирать картины русских художников, Павел Третьяков размещал их в жилых комнатах.',
      'галерея'),
  Sight(
      'Центральный парк культуры и отдыха им. М. Горького',
      '55.729919',
      '37.601348',
      'https://avatars.mds.yandex.net/get-altay/474904/2a0000015eb1b5f626ffa89658dde2b12a23/XXXL',
      'Парк культуры и отдыха.',
      'парк'),
  Sight(
      'Патриаршие пруды',
      '55.763855',
      '37.592132',
      'https://avatars.mds.yandex.net/get-altay/1001354/2a00000162874cd6ce152a8542931ecfe3ae/XXXL',
      'Общее название местности, расположенной в Пресненском районе Центрального административного округа города Москвы, куда входят пруд, сквер и микрорайон.',
      'парк'),
];
